{
  "basics": {
    "name": "Kari Noe",
    "label": "Undergraduate Student",
    "picture": "https://kariknoe.github.io/images/IMG-1288.JPG",
    "email": "karinoe@hawaii.edu",
    "phone": "",
    "website": "https://kariknoe.github.io",
    "summary": "Double-Major in Computer Science and Animation at the University of Hawai'i at Mānoa, Honors Student, expected graduation: Spring 2018.",
    "location": {
      "address": "",
      "postalCode": "",
      "city": "Honolulu",
      "countryCode": "",
      "region": "Hawai'i"
    },
    "profiles": [
      {
        "network": "github",
        "username": "kariknoe",
        "url": "http://github.com/kariknoe"
      },
      {
        "network": "linkedin",
        "username": "karinoe",
        "url": "http://linkedin.com/in/karinoe"
      },
    ]
  },
  "interests": [
    {
      "name": "Visualization",
      "keywords": [
      ]
    },
    {
      "name": "Virtual Reality",
      "keywords": [
      ]
    },
    {
      "name": "Animation",
      "keywords": [
      ]
    }
  ],
  "skills": [
    {
      "name": "Languages and Frameworks",
      "level": "",
      "keywords": [
        "Javascript",
        "Java",
        "PHP",
        "XQuery",
        "C#",
        "C++",
      ]
    },
    {
      "name": "Toolsets/OS",
      "level": "",
      "keywords": [
        "MacOS",
        "Windows",
        "Ubuntu",
        "Fedora",
        "Git/GitHub",
        "BitBucket",
      ]
    },
    {
      "name": "Software",
      "level": "",
      "keywords": [
        "Unity3d",
        "Maya",
        "Adobe Creative Suite (Photoshop, Premiere, After Effects)",
      ]
    }
  ],
  "education": [
    {
      "institution": "University of Hawai'i at Mānoa, Honolulu, HI",
      "area": "Double Major: Computer Science and Animation (expected Spring, 2018)",
      "studyType": "B.A.",
      "startDate": "2013-08-01",
      "endDate": "Present",
      "gpa": "3.7",
      "courses": [ 
        "Special Topics- Video Game Design,  Spring 2015",
        "Topics in Software- Virtual Reality,  Fall 2016",
        "Data Visualization,  Spring 2016",                   
      ]
    }
  ],
  
  "work": [
     {
      "company": "Laboratory of Advanced Visualization and Apllications (LAVA)",
      "position": "Undergraduate Research Assistant",
      "website": "http://lava.manoa.hawaii.edu/",
      "startDate": "2016-11",
      "endDate": "Present",
      "summary": "Assist in lab related research in Data Visualization and Virtual Reality. Perform demos for visitors of the lab.",
      "highlights": [
        
      ]
    },
    {
      "company": "Gregg M. Sinclair Library",
      "position": "Media Tech",
      "website": "http://guides.library.manoa.hawaii.edu/sinclairlibrary",
      "startDate": "2014-04",
      "endDate": "2017-03",
      "summary": "Developed and managed databases for various collection in the library. Organized and processed digital media files. Entered detailed data into databases and spreadsheets. Helped maintain data and statistics for monthly reports. Edited and encoded video using a Non Linear Editor. Embeded metadata. Streamed video. Performed special projects and other related duties as assigned.",
      "highlights": [
        "Media Tech II - April 2014 - April 2015",
        "Media Tech III - April 2015 - November 2015",
        "Media Tech IV - November 2015 - March 2017"
      ]
    },
    {
      "company": "Daniel K. Inouye Solar Telescope",
      "position": "Software Engineer, Akamai Intern",
      "website": "http://dkist.nso.edu/",
      "startDate": "2016-06-12",
      "endDate": "2016",
      "summary": " Intern Project Abstract: Remotely visualizing high resolution, image-based, data sets acquired by solar telescopes is challenging due to their multi-dimensionality and immense volume. Once fully operational, the Daniel K. Inouye Solar Telescope (DKIST) is estimated to produce 10 terabytes of imaging data per day. The DKIST Data Center needs a standard tool to visualize and share their imaging data sets with interested researchers and the public. With a goal of being able to visualize and share 100% of all relevant data collected from the telescope with minimal image degradation from compression, we have created a preliminary design of a visualization tool to handle that volume. This prototype is powered by the IIPImage server compiled with the Kakadu SDK to allow for JPEG2000 support. The visualization tool itself is built upon IIPMooviewer, an HTML5-based JavaScript high resolution image streaming and zooming client. Additional features were added to IIPMooviewer to optimize it for DKIST such as allowing for the manipulation of the following parameters: wavelength, polarization, and time. By adopting the JPEG2000 standard, our prototype allows for efficient transfer rates between the server and a remote user, while providing an extensible framework for the DKIST visualization tool interface.",
      "highlights": [
     
      ]
    }
  ],
  "awards": [
    {
      "title": "Honorable Mention",
      "date": "2017",
      "awarder": "University of Hawai'i at Mānoa Undergraduate Spring Showcase",
      "summary": "Received Engineering and Computer Sciences Honorable Mention for Undergraduate Research Oral Presentation"
    }
  ],
  "references": [
    {
      "name": "Available upon request",
      "reference": ""
    }
  ]
}
